---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures.StructuralMaterialAssetInvalid
source: html/bcda3bd7-9952-9266-b911-7bd8b9fccd3f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures.StructuralMaterialAssetInvalid Property

Material assigned to the Analytical Element does not contain Structure parameters - verify material content.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralMaterialAssetInvalid { get; }
```